app/controllers/forms_controller.rb

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
SELECT * FROM `forms` WHERE (`forms`.hospital_id = 1)
---
  def index
    @hospital = Hospital.find(params[:hospital_id])
    @forms = Form.all

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
SELECT * FROM `forms` WHERE (`forms`.`id` = 1)
SELECT * FROM `form_fields` WHERE (`form_fields`.form_id = 1) ORDER BY position
---
  def show
    @hospital = Hospital.find(params[:hospital_id])
    @form = Form.find(params[:id])
    @preview = FormPreview.new

    #Setting field values
    @form.form_fields.all.each do |field|

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
---
  def new
    @hospital = Hospital.find(params[:hospital_id])

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
INSERT INTO `forms` (`name`, `hospital_id`, `created_at`, `updated_at`, `user_id`, `description`) VALUES('Registration form', 1, '2010-03-24 09:54:43', '2010-03-24 09:54:43', NULL, 'Patient registration form')
---
  def create
    @hospital = Hospital.find(params[:hospital_id])
    @form = @hospital.forms.new(params[:form])
    if @form.save

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
SELECT * FROM `forms` WHERE (`forms`.`id` = 1)
---
  def edit
    @hospital = Hospital.find(params[:hospital_id])
    @form = Form.find(params[:id])

SELECT * FROM `forms` WHERE (`forms`.`id` = 3)
DELETE FROM `forms` WHERE `id` = 3
---
  def destroy
    @form = Form.find(params[:id])
    @form.destroy