app/controllers/hospitals_controller.rb

SELECT * FROM `hospitals`
---
  def index
    @hospitals = Hospital.all