app/controllers/patients_controller.rb

  def index
    @hospital = Hospital.find(params[:hospital_id])
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)

  def new
    @hospital = Hospital.find(params[:hospital_id])
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)

  def edit
    @patient = Patient.find(current_user.id)
    @hospital = @patient.hospital
    unless @hospital.forms.blank?
      @hospital.forms.first.form_fields.each do |field|
---
SELECT * FROM `forms` WHERE (`forms`.hospital_id = 1) LIMIT 1
SELECT * FROM `form_fields` WHERE (`form_fields`.form_id = 1) ORDER BY position

  def create
    @hospital = Hospital.find(params[:hospital_id])
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)