app/controllers/registration_forms_controller.rb

  def index
    @registration_forms = RegistrationForm.all
---
SELECT * FROM `registration_forms`

  def show
    @registration_form = RegistrationForm.find(params[:id])
    @preview = FormPreview.new

    #Dynamically setting FormPreview columns. Its a table less model
    @registration_form.form_fields.all.each do |field|
---
SELECT * FROM `registration_forms` WHERE (`registration_forms`.`id` = 0)
SELECT * FROM `form_fields` WHERE (`form_fields`.registration_form_id = 5) ORDER BY position

  def create
    @registration_form = RegistrationForm.new(params[:registration_form])
    if @registration_form.save
---
INSERT INTO `registration_forms` (`name`, `updated_at`, `description`, `user_id`, `created_at`) VALUES('Registration', '2010-03-13 05:46:58', 'Used for patient registration', NULL, '2010-03-13 05:46:58')

  def edit
    @registration_form = RegistrationForm.find(params[:id])
---
SELECT * FROM `registration_forms` WHERE (`registration_forms`.`id` = 1)

  def update
    @registration_form = RegistrationForm.find(params[:id])
    if @registration_form.update_attributes(params[:registration_form])
---
SELECT * FROM `registration_forms` WHERE (`registration_forms`.`id` = 1)
UPDATE `registration_forms` SET `updated_at` = '2010-03-11 07:13:59', `name` = '', `description` = '' WHERE `id` = 2

  def destroy
    @registration_form = RegistrationForm.find(params[:id])
    @registration_form.destroy
---
SELECT * FROM `registration_forms` WHERE (`registration_forms`.`id` = 4)
DELETE FROM `registration_forms` WHERE `id` = 4