app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `password_confirmation`, `updated_at`, `username`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `password`, `last_login_at`, `email`) VALUES('2010-03-12 10:50:34', '2010-03-12 10:50:34', '2f2b9a607d6cf011dab6fa9bf825e0f81984d83bc33b0f3eae2191db9669e50e2d0ba08fc86796ddf54a8d4454ccff7243916477b44daf8270ddd22200c3d2db', NULL, '2010-03-12 10:50:34', 'vijendra', '127.0.0.1', 'KG-e7W3juNd7bz8WfBsh', '2010-03-12 10:50:34', '603ec2d81ebdd28a23fddc285bbe1c5d8cdc6717eb5d05b6c0789905b6b75447abbc4cb750f14b1f2d66d353bf54720d45aef6cad8a938935bdf4ad8764c813b', 1, NULL, NULL, NULL, 'vijendrakarkala@gmail.com')